In [1]:
import pandas as pd
import numpy as np

In [2]:
file1 = pd.read_csv('file1.csv')
file2 = pd.read_csv('file2.csv')
file3 = pd.read_csv('file3.csv')

In [3]:
file1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
col_names = file1.columns
col_names

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

In [5]:
df = pd.DataFrame(columns=col_names)

In [6]:
file1.head()
file1.shape

(4008, 11)

In [7]:
file2 = file2.reindex(columns=col_names)
file2.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,Personal Auto,Four-Door Car,633.6
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,Special Auto,SUV,547.2
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,Personal Auto,Two-Door Car,537.6
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,Personal Auto,Luxury Car,1027.2
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,Corporate Auto,Two-Door Car,451.2

In [8]:
file3 = file3.rename(columns={'State':'ST', 'Gender':'GENDER'})
file3 = file3.reindex(columns=col_names)
file3.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,Personal Auto,Two-Door Car,499.200000
1,TB86706,Arizona,M,Master,2502.637401,0,66,0,Personal Auto,Two-Door Car,3.468912
2,ZL73902,Nevada,F,Bachelor,3265.156348,25820,82,0,Personal Auto,Four-Door Car,393.600000
3,KX23516,California,F,High School or Below,4455.843406,0,121,0,Personal Auto,SUV,699.615192
4,FN77294,California,M,High School or Below,7704.958480,30366,101,2,Personal Auto,SUV,484.800000

In [9]:
df = pd.concat([df, file1, file2, file3], axis=0)
df.shape

(12074, 11)

In [10]:
new_names = [i.lower() for i in df.columns]
df.columns = new_names
df.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [11]:
df.reset_index(drop=True, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12074 entries, 0 to 12073
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   st                         9137 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer lifetime value    9130 non-null   object
 5   income                     9137 non-null   float64
 6   monthly premium auto       9137 non-null   float64
 7   number of open complaints  9137 non-null   object
 8   policy type                9137 non-null   object
 9   vehicle class              9137 non-null   object
 10  total claim amount         9137 non-null   float64
dtypes: float64(3), object(8)
memory usage: 1.0+ MB

In [12]:
df.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value       object
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

In [13]:
df._get_numeric_data()

        income  monthly premium auto  total claim amount
0          0.0                1000.0            2.704934
1          0.0                  94.0         1131.464935
2      48767.0                 108.0          566.472247
3          0.0                 106.0          529.881344
4      36357.0                  68.0           17.269323
...        ...                   ...                 ...
12069  71941.0                  73.0          198.234764
12070  21604.0                  79.0          379.200000
12071      0.0                  85.0          790.784983
12072  21941.0                  96.0          691.200000
12073      0.0                  77.0          369.600000

[12074 rows x 3 columns]

In [14]:
df = df.drop_duplicates()

In [15]:
df.reset_index(drop=True, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9135 entries, 0 to 9134
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9134 non-null   object
 1   st                         9134 non-null   object
 2   gender                     9012 non-null   object
 3   education                  9134 non-null   object
 4   customer lifetime value    9127 non-null   object
 5   income                     9134 non-null   float64
 6   monthly premium auto       9134 non-null   float64
 7   number of open complaints  9134 non-null   object
 8   policy type                9134 non-null   object
 9   vehicle class              9134 non-null   object
 10  total claim amount         9134 non-null   float64
dtypes: float64(3), object(8)
memory usage: 785.2+ KB

In [16]:
nulls_df = pd.DataFrame(round(df.isna().sum()/len(df),4)*100) # round to 4 decimals and get the %
nulls_df = nulls_df.rename(columns={'index':'header', 0:'perc'})
nulls_df

                           perc
customer                   0.01
st                         0.01
gender                     1.35
education                  0.01
customer lifetime value    0.09
income                     0.01
monthly premium auto       0.01
number of open complaints  0.01
policy type                0.01
vehicle class              0.01
total claim amount         0.01

In [17]:
df = df[df['gender'].isna() == False]
df['gender'].value_counts()

F         4557
M         4368
Male        40
female      30
Femal       17
Name: gender, dtype: int64

In [18]:
df = df.drop(['education'], axis=1)
df = df.drop(['number of open complaints'], axis=1)

In [19]:
df.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,825629.78%,62902.0,69.0,Personal Auto,Two-Door Car,159.383042

In [20]:
df.shape

(9012, 9)

In [42]:
df['customer lifetime value'] = list(map(lambda x: str(x), df['customer lifetime value']))
df['customer lifetime value'] = list(map(lambda x: x.replace('%', ''), df['customer lifetime value']))
pd.to_numeric(df['customer lifetime value'], errors = "coerce")
df['customer lifetime value'] = list(map(lambda x: x*100, df['customer lifetime value']))
df['customer lifetime value']

1       697953.59697953.59697953.59697953.59697953.596...
2       1288743.171288743.171288743.171288743.17128874...
3       764586.18764586.18764586.18764586.18764586.187...
4       536307.65536307.65536307.65536307.65536307.655...
5       825629.78825629.78825629.78825629.78825629.788...
                              ...
9130    23405.9879823405.9879823405.9879823405.9879823...
9131    3096.5112173096.5112173096.5112173096.51121730...
9132    8163.8904288163.8904288163.8904288163.89042881...
9133    7524.4424367524.4424367524.4424367524.44243675...
9134    2611.8368662611.8368662611.8368662611.83686626...
Name: customer lifetime value, Length: 9012, dtype: object

In [43]:
df.reset_index(drop=True, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9012 entries, 0 to 9011
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer                 9012 non-null   object
 1   st                       9012 non-null   object
 2   gender                   9012 non-null   object
 3   customer lifetime value  9012 non-null   object
 4   income                   9012 non-null   float64
 5   monthly premium auto     9012 non-null   float64
 6   policy type              9012 non-null   object
 7   vehicle class            9012 non-null   object
 8   total claim amount       9012 non-null   float64
dtypes: float64(3), object(6)
memory usage: 633.8+ KB

In [44]:
df.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,QZ44356,Arizona,F,697953.59697953.59697953.59697953.59697953.596...,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
1,AI49188,Nevada,F,1288743.171288743.171288743.171288743.17128874...,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
2,WW63253,California,M,764586.18764586.18764586.18764586.18764586.187...,0.0,106.0,Corporate Auto,SUV,529.881344
3,GA49547,Washington,M,536307.65536307.65536307.65536307.65536307.655...,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
4,OC83172,Oregon,F,825629.78825629.78825629.78825629.78825629.788...,62902.0,69.0,Personal Auto,Two-Door Car,159.383042

In [47]:
filtered = df[(df['income'] > 0)]
filtered.shape

(6742, 9)